In [21]:
import pandas as pd
import os

In [22]:
train_df = pd.read_csv('aug_train.csv')

In [23]:
train_df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [25]:
train_df.drop(['city_development_index', 'last_new_job', 'training_hours'], axis = 'columns', inplace = True)
train_df.head()

,enrollee_id,city,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,target
0,8949,city_103,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1.0
1,29725,city_40,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,0.0
2,11561,city_21,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,0.0
3,33241,city_115,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,1.0
4,666,city_162,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,0.0

In [27]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   enrollee_id          19158 non-null  int64
 1   city                 19158 non-null  object
 2   gender               14650 non-null  object
 3   relevent_experience  19158 non-null  object
 4   enrolled_university  18772 non-null  object
 5   education_level      18698 non-null  object
 6   major_discipline     16345 non-null  object
 7   experience           19093 non-null  object
 8   company_size         13220 non-null  object
 9   company_type         13018 non-null  object
 10  target               19158 non-null  float64
dtypes: float64(1), int64(1), object(9)
memory usage: 1.6+ MB

In [32]:
train_df.dropna(how='any', inplace=True)
train_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8977 entries, 1 to 19155
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   enrollee_id          8977 non-null   int64
 1   city                 8977 non-null   object
 2   gender               8977 non-null   object
 3   relevent_experience  8977 non-null   object
 4   enrolled_university  8977 non-null   object
 5   education_level      8977 non-null   object
 6   major_discipline     8977 non-null   object
 7   experience           8977 non-null   object
 8   company_size         8977 non-null   object
 9   company_type         8977 non-null   object
 10  target               8977 non-null   float64
dtypes: float64(1), int64(1), object(9)
memory usage: 841.6+ KB

In [38]:
train_df.to_csv('train_cleaned.csv')